#### https://www.geeksforgeeks.org/pandas-practice-excercises-questions-and-solutions/

In [61]:
import pandas as pd
import numpy as np
import re

### 1. Make a Pandas DataFrame with two-dimensional list | Python

In [2]:
data = [["Name", "Akash"], ["Occupation", "DS"], ["Salary", 5000000]]
two_dim = pd.DataFrame(data,columns=list("AB"),index=list("abc"))
two_dim

            A        B
a        Name    Akash
b  Occupation       DS
c      Salary  5000000

### 2. Python | Creating DataFrame from dict of narray/lists

In [5]:
narray_data = {
    "Numbers" : np.arange(1,5),
    "square" : np.arange(1,5)**2,
    "Random" : np.random.randint(1,5,size=4)
}
# narray_data
n_array_data = pd.DataFrame(narray_data)
n_array_data

   Numbers  square  Random
0        1       1       2
1        2       4       3
2        3       9       3
3        4      16       2

In [6]:
narray_data = {
    "Numbers" : [1,2,3,4,5],
    "square" : np.array([1,2,3,4,5])**2,
    "Random" : np.random.randint(1,5,size=5)
}
n_array_data = pd.DataFrame(narray_data)
n_array_data

   Numbers  square  Random
0        1       1       3
1        2       4       3
2        3       9       2
3        4      16       3
4        5      25       4

### 3. Creating Pandas dataframe using list of lists

In [8]:
df_list = [["Akash", 22, "Oracle"], ["Yash", 22, "Google"], ["Niranjan", 24, "Amazon"]]

df_l = pd.DataFrame(df_list,columns=["Name", "Age", "Company"], index= ["1st", "2nd", "3rd"])
df_l

         Name  Age Company
1st     Akash   22  Oracle
2nd      Yash   22  Google
3rd  Niranjan   24  Amazon

### 5. Creating a Pandas dataframe using list of tuples

In [10]:
df_tup = [("Akash", 22, "Oracle"), ("Yash", 22, "Google"), ("Niranjan", 24, "Amazon")]

df_tuple = pd.DataFrame(df_tup, columns=("Names", "Age", "Company"), index=list("ABC"))
df_tuple

      Names  Age Company
A     Akash   22  Oracle
B      Yash   22  Google
C  Niranjan   24  Amazon

### 6. Create a Pandas DataFrame from List of Dicts

In [14]:
df_dic = {
    "Names" : ["Narniya", "Yash", "Niranjan"],
    "Age" : [23,22,24],
    "Company" : ["Oracle", "Google", "Amazon"]
}
df_data = pd.DataFrame(df_dic, index=list("ABC"))
df_data

      Names  Age Company
A   Narniya   23  Oracle
B      Yash   22  Google
C  Niranjan   24  Amazon

In [40]:
data_list = [
        {
        "Student": [{"Exam": 90, "Grade": "a"},
                    {"Exam": 99, "Grade": "b"},
                    {"Exam": 97, "Grade": "c"},
                   ],
        "Name": "Paras Jain"
        },
        {
        "Student": [{"Exam": 89, "Grade": "a"},
                    {"Exam": 80, "Grade": "b"}
                   ],
        "Name": "Chunky Pandey"
        }
       ]
data_list

[{'Student': [{'Exam': 90, 'Grade': 'a'},
   {'Exam': 99, 'Grade': 'b'},
   {'Exam': 97, 'Grade': 'c'}],
  'Name': 'Paras Jain'},
 {'Student': [{'Exam': 89, 'Grade': 'a'}, {'Exam': 80, 'Grade': 'b'}],
  'Name': 'Chunky Pandey'}]

In [42]:
data_list[0]

{'Student': [{'Exam': 90, 'Grade': 'a'},
  {'Exam': 99, 'Grade': 'b'},
  {'Exam': 97, 'Grade': 'c'}],
 'Name': 'Paras Jain'}

In [43]:
data_list[1]

{'Student': [{'Exam': 89, 'Grade': 'a'}, {'Exam': 80, 'Grade': 'b'}],
 'Name': 'Chunky Pandey'}

In [60]:
AllData = []
for data in data_list:
#     print(data)
    row_data = data["Student"]
    name = data["Name"]
    print(name)
    
    for rd in row_data:
        rd["Name"] = name
        AllData.append(rd)
        
AllData

Paras Jain
Chunky Pandey

[{'Exam': 90, 'Grade': 'a', 'Name': 'Paras Jain'},
 {'Exam': 99, 'Grade': 'b', 'Name': 'Paras Jain'},
 {'Exam': 97, 'Grade': 'c', 'Name': 'Paras Jain'},
 {'Exam': 89, 'Grade': 'a', 'Name': 'Chunky Pandey'},
 {'Exam': 80, 'Grade': 'b', 'Name': 'Chunky Pandey'}]

In [58]:
df = pd.DataFrame(rows)
df

   Exam Grade           Name
0    90     a     Paras Jain
1    99     b     Paras Jain
2    97     c     Paras Jain
3    89     a  Chunky Pandey
4    80     b  Chunky Pandey

### 7. Replace values in Pandas dataframe using regex

In [91]:
df.replace(to_replace=["a", "b", "c"], value=["A", "B", "C"],regex=False)

   Exam Grade           Name
0    90     A     Paras Jain
1    99     B     Paras Jain
2    97     C     Paras Jain
3    89     A  Chunky Pandey
4    80     B  Chunky Pandey

In [95]:
df.replace(to_replace=["a", "b", "c"], value=["A", "B", "C"],regex=True)

   Exam Grade           Name
0    90     A     PArAs JAin
1    99     B     PArAs JAin
2    97     C     PArAs JAin
3    89     A  Chunky PAndey
4    80     B  Chunky PAndey